'use strict';

angular.module('DisignStudio')

    .controller('NavCtrl', function($rootScope,Cloudinary, $scope, $state, $http) {
        angular.element(document).ready(function () {
            $(".dropdown-button").dropdown();
        });

        $scope.projectCode = 3;
        $scope.navbar;

        var initRequestUrl = 'http://' + $rootScope.domain + '/api/project';

        function init() {
            if ($rootScope.isDebugMode) {
                $scope.navbar = {
                    "title": "חלומות פרדס חנה - כרכור",
                    "location": "נווה פרדסים",
                    "logo": "projects/shikunbinuidpchk/project-logo",
                    "entrepreneurCachedData": {
                        "logo": "entrepreneurs/shikunvebinui-logo.png",
                        "about": "<p>שיכון ובינוי נדל”ן הינה חברת הנדל”ן הגדולה בישראל הנהנית מחוסן כלכלי ומצמיחה מתמדת.</p>\n\n<p>החברה הינה הזרוע היזמית של קבוצת שיכון ובינוי, שבשנת 2011 קבעו סקרי BDI ו-B&D כי היא חברת התשתיות והנדל”ן המובילה בישראל.</p>\n\n<p> החברה הוקמה לפני 90 שנה ועד היום בנתה מעל 185,000 יחידות דיור בכל רחבי הארץ ליותר ממיליון איש.\n מאז נוסדה, פועלת החברה מתוך חזון לבניית הארץ, ועושה זאת בהצלחה רבה ובהתאמה לצרכים המשתנים של האוכלוסייה.</p>\n\n<p> שיכון ובינוי נדל”ן מגשימה לאורך השנים חלומות של משפחות רבות באמצעות הקמת סביבת מגורים משפחתית מושלמת, ומקימה את שכונותיה החדשות בגישה נוחה לכבישים מרכזיים כמו כביש 6 ולתחנות רכבת, והופכת את מרכז הארץ לנגיש במיוחד. שיכון ובינוי נדל”ן מעודדת חיי קהילה פעילים בשכונותיה ומשתפת פעולה עם תושבי השכונה, עוד אחד מהיתרונות שהופכים את שכונות החלומות שלה למבוקשות ביותר בארץ.</p>\n\n <p>חברת שיכון ובינוי נדל”ן מובילה את הבנייה הירוקה בישראל, והיא הראשונה שקיבלה הלכה למעשה תו תקן ירוק 5281 לבנייה רוויה בגמר בנייה. כחלק מקבוצת שיכון ובינוי, דוגלת החברה בעקרונות הקיימות, ובכל הפרויקטים שלה ברחבי הארץ היא בונה עפ”י תקנים לבנייה ירוקה. האלמנטים הירוקים בפרויקט כוללים: צמחייה חסכונית במים בגינון, הכנה להפרדת סוגי פסולת, בידוד אקוסטי ותרמי משופר, זיגוג LOW-E בדירות הפונות לדרום, פאנל מרכזי בכניסה לדירה להדלקה וכיבוי של תאורה ומזגן, הכנה למאווררי תקרה בשני חדרים, מערכת להגנה מנזקי האבנית בצנרת אספקת המים, חסכמים בברזים והכנה לחימום מים בגז. </p>"
                    },
                    "apartmentTemplateCachedData": [{
                        "id": 1,
                        "name": "דירת 5 חדרים | טיפוס A1"
                    }, {
                        "id": 2,
                        "name": "דירת 5 חדרים | טיפוס A2"
                    }, {
                        "id": 3,
                        "name": "דירת 4 חדרים | טיפוס B1"
                    }, {
                        "id": 4,
                        "name": "דירת 4 חדרים | טיפוס B2"
                    }, {
                        "id": 5,
                        "name": "מיני פנטהאוז 5 חדרים | טיפוס MPH1 "
                    }, {
                        "id": 6,
                        "name": "מיני פנטהאוז 5 חדרים | טיפוס MPH2 "
                    }, {
                        "id": 7,
                        "name": "מיני פנטהאוז 5 חדרים | טיפוס MPH3 "
                    }, {
                        "id": 8,
                        "name": "פנטהאוז 5 חדרים | טיפוס PH1"
                    }, {
                        "id": 9,
                        "name": "פנטהאוז 5 חדרים | טיפוס PH2"
                    }]
                }
            } else {
                $http.get(initRequestUrl, {
                    params: {
                        code: $scope.projectCode
                    }
                }).success(function(res) {
                    if (res.data) {
                        $scope.navbar = res.data;
                    }
                }).error(function(e) {
                    //
                });
            }

        }

        init();
    })
